Repository: andreapianidev/WalkieTalkie
Catalog: WalkieTalkie/*.lproj/Localizable.strings
Languages: ms

source: Coming Soon
ms: Akan Datang

source: Cancel
ms: Batal

source: Error
ms: Ralat

source: Accept
ms: Terima

source: Decline
ms: Tolak

source: Disconnect
ms: Putuskan

source: Settings
ms: Tetapan

source: Retry
ms: Cuba Lagi

source: Unknown
ms: Tidak Diketahui

source: Version
ms: Versi

source: Developed by
ms: Dibangunkan oleh

source: Website
ms: Laman Web

source: New Device Detected
ms: Peranti Baru Dikesan

# device_detected_message
source: %@ detected nearby
ms: %@ dikesan berdekatan

source: Connection Established
ms: Sambungan Diwujudkan

# connected_to_device
source: Connected to %@
ms: Disambung ke %@

source: Connection Lost
ms: Sambungan Terputus

# disconnected_from_device
source: Disconnected from %@
ms: Diputuskan dari %@

source: Incoming Transmission
ms: Penghantaran Masuk

source: Receiving audio message
ms: Menerima mesej audio

source: Background Scan
ms: Imbasan Latar Belakang

# scanning_for_devices
source: Scanning for nearby devices
ms: Mengimbas peranti berdekatan

source: Notifications
ms: Pemberitahuan

source: Enable Notifications
ms: Dayakan Pemberitahuan

source: Disable Notifications
ms: Lumpuhkan Pemberitahuan

# notification_description
source: Receive notifications when new devices are detected or during transmissions
ms: Terima pemberitahuan apabila peranti baru dikesan atau semasa penghantaran

source: Notifications Enabled
ms: Pemberitahuan Didayakan

# notifications_activated_message
source: You will now receive notifications for device detection and transmissions
ms: Anda kini akan menerima pemberitahuan untuk pengesanan peranti dan penghantaran

source: Charging
ms: Mengecas

source: Full
ms: Penuh

source: Unplugged
ms: Tidak Dipasang

source: Frequency Owner
ms: Pemilik Frekuensi

source: Device
ms: Peranti

source: no error
ms: tiada ralat

source: Channel 1
ms: Saluran 1

source: EN
ms: MS

source: HOLD
ms: TAHAN

source: PRESSED
ms: DITEKAN

source: TO TALK
ms: UNTUK BERCAKAP

source: RELEASE
ms: LEPASKAN

source: TO SEND
ms: UNTUK HANTAR

# radio_fm_caps
source: FM MODE
ms: MOD FM

source: ACTIVE
ms: AKTIF

source: No connection
ms: Tiada sambungan

source: devices connected
ms: peranti disambung

source: TRANSMISSION IN PROGRESS
ms: PENGHANTARAN SEDANG BERLANGSUNG

source: RECEPTION IN PROGRESS
ms: PENERIMAAN SEDANG BERLANGSUNG

source: no transmission
ms: tiada penghantaran

source: Talk
ms: Bercakap

source: Explore
ms: Terokai

source: Connections
ms: Sambungan

# settings_tab
source: Settings
ms: Tetapan

source: Performance
ms: Prestasi

# performance_title
source: Performance
ms: Prestasi

source: High Traffic
ms: Trafik Tinggi

source: Normal Performance
ms: Prestasi Normal

# connections_active
source: active connections
ms: sambungan aktif

# memory_usage
source: Memory
ms: Penggunaan Memori

# network_latency
source: Avg Latency
ms: Kelewatan Rangkaian

source: Performance Trends
ms: Trend Prestasi

source: Connection Time
ms: Masa Sambungan

# active_connections
source: Connections
ms: Sambungan Aktif

# no_recommendations
source: No recommendations at the moment. Performance is optimal!
ms: Tiada cadangan pada masa ini. Prestasi adalah optimum!

# too_many_connections_warning
source: Too many connections (%d) - Consider limiting to 6-8 for optimal performance
ms: Terlalu banyak sambungan (%d) - Pertimbangkan untuk mengehadkan kepada 6-8 untuk prestasi optimum

source: Station
ms: Stesen

source: No station
ms: Tiada stesen

source: Buffering...
ms: Menimbal...

source: Country
ms: Negara

source: Scanning...
ms: Mengimbas...

# connections_title
source: Connections
ms: Sambungan

# manage_connections
source: Manage walkie talkie connections
ms: Urus sambungan walkie talkie

source: Connected devices
ms: Peranti yang disambung

source: Scanning in progress...
ms: Imbasan sedang berlangsung...

source: Offline
ms: Luar Talian

source: Online
ms: Dalam Talian

source: Advertising
ms: Mengiklan

source: Browsing
ms: Melayari

source: ON
ms: HIDUP

source: OFF
ms: MATI

# connected_devices_count
source: Connected Devices
ms: Peranti Disambung

source: No devices connected
ms: Tiada peranti disambung

# devices_nearby_hint
source: Make sure other devices are nearby and have the app open
ms: Pastikan peranti lain berdekatan dan mempunyai aplikasi terbuka

source: Connected
ms: Disambung

source: Disconnect All
ms: Putuskan Semua

source: Restart Discovery
ms: Mula Semula Penemuan

source: Disconnect Device
ms: Putuskan Peranti

# disconnect_confirmation
source: Are you sure you want to disconnect from all devices?
ms: Adakah anda pasti mahu memutuskan sambungan dari semua peranti?

# explore_title
source: Explore
ms: Terokai

source: Scan nearby devices
ms: Imbas peranti berdekatan

source: Detected Devices
ms: Peranti Dikesan

# no_devices_detected
source: No device detected
ms: Tiada peranti dikesan

# ensure_devices_open
source: Make sure other devices have the app open
ms: Pastikan peranti lain mempunyai aplikasi terbuka

source: Available
ms: Tersedia

source: Strong
ms: Kuat

source: Medium
ms: Sederhana

source: Weak
ms: Lemah

# settings_title
source: Settings
ms: Tetapan

# configure_app
source: Configure your app
ms: Konfigurasi aplikasi anda

source: White Noise
ms: Bunyi Putih

source: Background Audio
ms: Audio Latar Belakang

# background_audio_description
source: Background audio during use
ms: Audio latar belakang semasa penggunaan

source: Noise Volume
ms: Volum Bunyi

# adjust_background_volume
source: Adjust background noise volume
ms: Laraskan volum bunyi latar belakang

source: Haptic Feedback
ms: Maklum Balas Haptik

# vibration_on_buttons
source: Vibration when pressing buttons
ms: Getaran apabila menekan butang

source: Auto Connect
ms: Sambung Auto

# auto_connect_description
source: Automatically connect to known devices
ms: Sambung secara automatik ke peranti yang dikenali

source: Voice Activation
ms: Pengaktifan Suara

# voice_activation_description
source: Transmit automatically when speaking
ms: Hantar secara automatik apabila bercakap

source: Voice Sensitivity
ms: Kepekaan Suara

# voice_sensitivity_description
source: Adjust sensitivity for voice activation
ms: Laraskan kepekaan untuk pengaktifan suara

source: Low Power Mode
ms: Mod Kuasa Rendah

# low_power_mode_description
source: Reduces battery consumption
ms: Mengurangkan penggunaan bateri

source: Reset Settings
ms: Set Semula Tetapan

# how_to_use
source: How to Use the App
ms: Cara Menggunakan Aplikasi

# instruction_1_title
source: Open App on All Devices
ms: Buka Aplikasi di Semua Peranti

# instruction_1_description
source: Make sure all devices have the WalkieTalkie app open and active.
ms: Pastikan semua peranti mempunyai aplikasi WalkieTalkie terbuka dan aktif.

# instruction_2_title
source: Go to Connections
ms: Pergi ke Sambungan

# instruction_2_description
source: Tap the 'Connections' tab to see available devices nearby.
ms: Ketik tab 'Sambungan' untuk melihat peranti yang tersedia berdekatan.

# instruction_3_title
source: Connect Devices
ms: Sambung Peranti

# instruction_3_description
source: Select a device from the list to send a connection request.
ms: Pilih peranti dari senarai untuk menghantar permintaan sambungan.

# instruction_4_title
source: Select Frequency
ms: Pilih Frekuensi

# instruction_4_description
source: All connected devices must use the same frequency to communicate.
ms: Semua peranti yang disambung mesti menggunakan frekuensi yang sama untuk berkomunikasi.

# instruction_5_title
source: Hold to Talk
ms: Tahan untuk Bercakap

# instruction_5_description
source: Hold the center button to transmit. Release to listen.
ms: Tahan butang tengah untuk menghantar. Lepaskan untuk mendengar.

# app_info
source: App Information
ms: Maklumat Aplikasi

source: Support Development
ms: Sokong Pembangunan

# buy_me_coffee
source: Buy me a coffee
ms: Belikan Saya Kopi

# support_description
source: If you like this app, consider supporting the developer
ms: Jika anda suka aplikasi ini, pertimbangkan untuk menyokong pembangun

# view_performance
source: View Performance Stats
ms: Lihat Statistik Prestasi

source: Background Playback
ms: Main Latar Belakang

# background_playback_description
source: Continue radio playback when app is in background
ms: Teruskan main radio apabila aplikasi di latar belakang

source: Now Playing
ms: Sedang Dimainkan

# control_center_info
source: Control playback from Control Center and Lock Screen
ms: Kawal main dari Pusat Kawalan dan skrin kunci

source: Appearance
ms: Penampilan

source: Dark Mode
ms: Mod Gelap

# dark_mode_description
source: Use dark theme for the app interface
ms: Gunakan tema gelap untuk antara muka aplikasi

# peak_app_title
source: Peak: Altimeter for Hikers
ms: Peak: Altimeter untuk Pendaki

# peak_app_description
source: Free altimeter for hikers with AI and integrated walkie talkie
ms: Altimeter percuma untuk pendaki dengan AI dan walkie talkie bersepadu

source: Download Peak App
ms: Muat Turun Aplikasi Peak

source: Connection Request
ms: Permintaan Sambungan

source: wants to connect
ms: mahu menyambung

source: Microphone Permission Required
ms: Kebenaran Mikrofon Diperlukan

# microphone_permission_message
source: The WalkieTalkie app needs microphone access to function properly. Without this permission, you won't be able to transmit audio.
ms: Aplikasi WalkieTalkie memerlukan akses mikrofon untuk berfungsi dengan betul. Tanpa kebenaran ini, anda tidak akan dapat menghantar audio.

# audio_transmission_error
source: Audio transmission error: The operation couldn't be completed. (com.apple.coreaudio.avfaudio error -10851.)
ms: Ralat penghantaran audio: Operasi tidak dapat diselesaikan. (com.apple.coreaudio.avfaudio error -10851.)

# no_connected_peers
source: No connected devices
ms: Tiada peranti disambung

# onboarding_welcome_title
source: Welcome to WalkieTalkie
ms: Selamat Datang ke WalkieTalkie

# onboarding_welcome_subtitle
source: Professional walkie-talkie communication for your adventures
ms: Komunikasi walkie-talkie profesional untuk pengembaraan anda

# onboarding_how_it_works_title
source: How It Works
ms: Bagaimana Ia Berfungsi

# onboarding_how_it_works_description
source: WalkieTalkie transforms your iPhone into a professional walkie-talkie device for seamless communication with nearby devices.
ms: WalkieTalkie mengubah iPhone anda menjadi peranti walkie-talkie profesional untuk komunikasi lancar dengan peranti berdekatan.

# onboarding_connectivity_title
source: Advanced Connectivity
ms: Sambungan Canggih

# onboarding_connectivity_description
source: Multiple connection methods ensure reliable communication:
ms: Pelbagai kaedah sambungan memastikan komunikasi yang boleh dipercayai:

# onboarding_bluetooth_feature
source: • Bluetooth for close-range communication
ms: • Bluetooth untuk komunikasi jarak dekat

# onboarding_wifi_feature
source: • Wi-Fi for enhanced performance
ms: • Wi-Fi untuk prestasi yang dipertingkatkan

# onboarding_multipeer_feature
source: • Apple's Multipeer Connectivity for mesh networking
ms: • Multipeer Connectivity Apple untuk rangkaian mesh

# onboarding_range_feature
source: • Up to 1km range in optimal conditions
ms: • Sehingga 1km jangkauan dalam keadaan optimum

# onboarding_frequency_title
source: Frequency System
ms: Sistem Frekuensi

# onboarding_frequency_description
source: All devices must be set to the same frequency to communicate. The default home frequency is 428.283 MHz.
ms: Semua peranti mesti ditetapkan pada frekuensi yang sama untuk berkomunikasi. Frekuensi rumah lalai ialah 428.283 MHz.

# onboarding_home_frequency
source: Home Frequency: 428.283 MHz
ms: Frekuensi Rumah: 428.283 MHz

# onboarding_permissions_title
source: Required Permissions
ms: Kebenaran Diperlukan

# onboarding_permissions_description
source: To provide the best experience, WalkieTalkie needs access to:
ms: Untuk memberikan pengalaman terbaik, WalkieTalkie memerlukan akses kepada:

# onboarding_microphone_permission
source: • Microphone - Essential for voice transmission
ms: • Mikrofon - Penting untuk penghantaran suara

# onboarding_network_permission
source: • Local Network - Required for device discovery
ms: • Rangkaian Tempatan - Diperlukan untuk penemuan peranti

# onboarding_bluetooth_permission
source: • Bluetooth - For device connectivity
ms: • Bluetooth - Untuk sambungan peranti

# onboarding_notification_permission
source: • Notifications - For incoming calls and alerts
ms: • Pemberitahuan - Untuk panggilan masuk dan amaran

# onboarding_continue
source: Continue
ms: Teruskan

# onboarding_get_started
source: Get Started
ms: Mula

# onboarding_allow_permissions
source: Allow Permissions
ms: Benarkan Kebenaran

# onboarding_skip
source: Skip
ms: Langkau

# onboarding_up_to_eight_devices
source: Connect up to 8 devices simultaneously
ms: Sambung sehingga 8 peranti serentak

# onboarding_mountain_use
source: Perfect for mountain expeditions
ms: Sempurna untuk ekspedisi gunung

# onboarding_excursion_use
source: Ideal for hiking and outdoor activities
ms: Sesuai untuk mendaki dan aktiviti luar
